---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarShape.SimpleArc
source: html/7c63c3f5-bac9-9d24-90fd-8dbc03a6df4f.htm
---
# Autodesk.Revit.DB.Structure.RebarShape.SimpleArc Property

Check whether this shape consists of a single arc, possibly with hooks.

## Syntax (C#)
```csharp
public bool SimpleArc { get; }
```